//alert('Внимание! После того как нажмёте на нужный вам разлел и прочитаете информацию, для дальнейшего взаимодействия с данными сайта, нажмите на кнопу "Перезагруза страницы".P.S. Кнопка "Перезагрузка страницы" находится в верху сайта. Приносим извинения за временное неудобство.---Гуляев К. И.---')

//1127-ошибка гороскопа, отсутствуют данные

/*
  // Определяем массив
var arr = ['PHP', 'JavaScript', 'Python', 'Perl', 'Ruby', 'Go', 'Java'];

// Получаем случайный ключ массива
var rand = Math.floor(Math.random() * arr.length);

alert(arr[rand]);// Выведем, например: JavaScript
*/

/*
//Форма авторизации

document.getElementById("bxod").onclick=function(){
  let log=document.getElementById('login').value;
  let pass=document.getElementById('password').value;
  if(log == 'Кирилл' && pass == '1992'){
    window.location.href=('index3.php');
  }
  else{
    alert('Неправильный логин или пароль, доступ запрещён!');
  }
  }
  */

/*
var arr = ['PHP', 'JavaScript', 'Python', 'Perl', 'Ruby', 'Go', 'Java'];
var rand = Math.floor(Math.random() * arr.length);
document.getElementById('z_zitata_1')=function(){
  document.write(kk[rand]);
}
*/

//https://forms.yandex.ru/u/62590dc56fe214ecb5dd1761/

//<table border="1"><tr><td align="center" style="background-color: white;"><span style="color:purple"><h1><b>Заголовок</h1></b></span><h3><br/><br/>Текст</h3></td></tr>

//<hr/><br/><br/><span style="color:purple"><h1><b>Заголовок</h1></b></span><h3><br/><br/>Текст</h3>

//function kash(){
//document.getElementById("kasha").innerHTML='';
//}

//<br/> -  (  )

/*
var myDate = '5.7'; 
var current = new Date;
if (current.getDate () + '.' + (current.getMonth () + 1) == myDate)
   document.getElementById("g_lev_5").innerText='';
*/

/*


var myDate = '10.7'; 
var current = new Date;
if (current.getDate () + '.' + (current.getMonth () + 1) == myDate)
   alert("С днём рыбака !");
   
var myDate = '11.7'; 
var current = new Date;
if (current.getDate () + '.' + (current.getMonth () + 1) == myDate)
   alert("С всемирным днём шоколада !");
var myDate = '12.7'; 
var current = new Date;
if (current.getDate () + '.' + (current.getMonth () + 1) == myDate)
   alert("С всемирным днём бортпроводника гражданской авиации !");
var myDate = '13.7'; 
var current = new Date;
if (current.getDate () + '.' + (current.getMonth () + 1) == myDate)
   alert("С международным днём головоломки !");
var myDate = '14.7'; 
var current = new Date;
if (current.getDate () + '.' + (current.getMonth () + 1) == myDate)
   alert("С днём беспорядка !");
var myDate = '15.7'; 
var current = new Date;
if (current.getDate () + '.' + (current.getMonth () + 1) == myDate)
   alert("С всемирным денём навыков молодежи !");
var myDate = '16.7'; 
var current = new Date;
if (current.getDate () + '.' + (current.getMonth () + 1) == myDate)
   alert("С днём вкусной еды !");
var myDate = '17.7'; 
var current = new Date;
if (current.getDate () + '.' + (current.getMonth () + 1) == myDate)
   alert("С днём металлурга !");
var myDate = '18.7'; 
var current = new Date;
if (current.getDate () + '.' + (current.getMonth () + 1) == myDate)
   alert("С днём прогулок под дождём !");
var myDate = '19.7'; 
var current = new Date;
if (current.getDate () + '.' + (current.getMonth () + 1) == myDate)
   alert("С днём Москвы-реки!");
var myDate = '20.7'; 
var current = new Date;
if (current.getDate () + '.' + (current.getMonth () + 1) == myDate)
   alert("С международным днём торта !");




                  
                                                          



   var myDate = '1.9';
   var current = new Date;
   if (current.getDate () + '.' + (current.getMonth () + 1) == myDate)
   document.getElementById("g_lev_1").innerText='Сегодня Львы должны сказать себе – «Я смогу!», потому что реально смогут. Все новости дня стоит воспринимать спокойно Львам. Вспомните пословицу – «Тише едешь – дальше будешь», и ни к чему так спешить, пока в спешке ничего не натворили. 01.08.2022';
   var myDate = '1.9';
   var current = new Date;
   if (current.getDate () + '.' + (current.getMonth () + 1) == myDate)
   document.getElementById("g_raba_1").innerText='Возможно, сегодняшний день пройдет для Рыб несколько загадочно, но очень скоро все загадки будут разгаданы. На работе возможно появление новых кадров или новых правил. Сегодня Рыбы могут остро почувствовать свое одиночество в этом мире. 01.08.2022';
   var myDate = '1.9';
   var current = new Date;
   if (current.getDate () + '.' + (current.getMonth () + 1) == myDate)
   document.getElementById("g_deva_1").innerText='Как бы ни захотела жизнь покрутить Дев, они все равно волшебным образом будут оказываться сверху. Подумайте о том, чего бы вам очень хотелось, и осуществите это. Не смотрите сегодня людям в глаза, вы не найдете в них ни ответов ни понимания. 01.08.2022';
   var myDate = '1.9';
   var current = new Date;
   if (current.getDate () + '.' + (current.getMonth () + 1) == myDate)
   document.getElementById("g_vodoley_1").innerText='Сегодня возможен маленький сюрприз для Водолеев, который тронет их до глубины души. Чтоб сегодня не случилось, не выдавайте собственных эмоций окружающим. Сегодня Водолеям неполезно много думать. 01.08.2022';
   
   var myDate = '2.9';
   var current = new Date;
   if (current.getDate () + '.' + (current.getMonth () + 1) == myDate)
   document.getElementById("g_lev_2").innerText='Львы, разрешите тому, кто сегодня рядом с вами побаловать вас, ваш лед уже не уместен, пришло время растаять и вы не пожалеете. Не напрашивайтесь в гости, сегодня вы не совсем желанный гость. Сегодня у кого-то из Львов может рухнуть привычный мир. 02.08.2022';
   var myDate = '2.9';
   var current = new Date;
   if (current.getDate () + '.' + (current.getMonth () + 1) == myDate)
   document.getElementById("g_raba_2").innerText='Сегодня отличный день для того, чтоб избавиться от плохой привычки. Сегодня Рыбы будут ждать от кого-то поддержки, но им не стоит на этом зацикливаться. Рыбы будут гореть желанием выплеснуть на кого-то свой пар, но это будет неправильно. 02.08.2022';
   var myDate = '2.9';
   var current = new Date;
   if (current.getDate () + '.' + (current.getMonth () + 1) == myDate)
   document.getElementById("g_deva_2").innerText='Сегодня множество людей будут тянуться к Девам, как подсолнухи к солнцу, вам это будет лестно, главное, чтоб вашего тепла на всех хватило. Девы, сейчас тяжелые времена, но вспомните, свою мечту и вытрите слезы. Девы, с таким настроением вы слона не продадите. 02.08.2022';
   var myDate = '2.9';
   var current = new Date;
   if (current.getDate () + '.' + (current.getMonth () + 1) == myDate)
   document.getElementById("g_vodoley_2").innerText='Смех без причины признак дурачины, но Водолеи знают, почему им так весело сегодня. Если Водолеев куда-то несет, то лучше им пойти за своими порывами, иначе потом будут себя съедать. Водолеи, вспомните о жизненных приоритетах! 02.08.2022';
   var myDate = '3.9';
   var current = new Date;
   if (current.getDate () + '.' + (current.getMonth () + 1) == myDate)
   document.getElementById("g_lev_3").innerText='Если кто-то уже давно стучит к вам в дверь, а вы все притворяетесь, что вас нет дома, то сегодня Львам следует открыть эту дверь, потому что в нее может войти кто-то очень добрый и хороший. Сегодня к вам могут постучаться долгожданные изменения, постарайтесь не спугнуть их. Возможно, сегодня коллега Львов захочет перевести стрелки своих ошибок на него. 03.08.2022';
   var myDate = '3.9';
   var current = new Date;
   if (current.getDate () + '.' + (current.getMonth () + 1) == myDate)
   document.getElementById("g_raba_3").innerText='У Рыб возможны долгожданные новости. Даже если у Рыб не так много денег, как ему хотелось бы, сегодня нужно себя немного побаловать и расслабиться вечером. Рыбам полезно хоть ненадолго уединиться, а может даже поспать. 03.08.2022';
   var myDate = '3.9';
   var current = new Date;
   if (current.getDate () + '.' + (current.getMonth () + 1) == myDate)
   document.getElementById("g_deva_3").innerText='Не позволяйте всяким мелочам испортить свое настроение. Отдых в компании друзей – это именно то, что так нужно сегодня Девам. Возможно, кто-то попробует что-то решить за Дев, но стоит подумать дважды – нужна ли ему такая услуга, за которую потом придется дорого платить. 03.08.2022';
   var myDate = '3.9';
   var current = new Date;
   if (current.getDate () + '.' + (current.getMonth () + 1) == myDate)
   document.getElementById("g_vodoley_3").innerText='Сегодня Водолеи могут смело идти к своему начальнику с любыми предложениями, он вас выслушает, поймет и поддержит. Строить дальновидные планы на жизнь можно Водолеям, главное быть более реалистичным. Водолеи проведут весь день в ожидании вечера, но не все их надежды будут оправданы. 03.08.2022';
   
   var myDate = '4.9';
   var current = new Date;
   if (current.getDate () + '.' + (current.getMonth () + 1) == myDate)
   document.getElementById("g_lev_4").innerText='Гороскоп на сегодня благоприятен для умственной деятельности, решения нетривиальных задач. Оглянитесь вокруг, и насладитесь окружающей вас природой. Вероятны денежные траты. 04.08.2022';
   var myDate = '4.9';
   var current = new Date;
   if (current.getDate () + '.' + (current.getMonth () + 1) == myDate)
   document.getElementById("g_raba_4").innerText='Если в ваших отношениях с любимым человеком были не самые лучшие времена, то сегодня этот плохой период будет закончен, и опять настанет букетно цветочный. У Рыб сегодняшний день пройдет на бегу, и по идее он должен все успеть. Сегодня Рыбы не смогут простить причиненную им боль от любимого человека. 04.08.2022';
   var myDate = '4.9';
   var current = new Date;
   if (current.getDate () + '.' + (current.getMonth () + 1) == myDate)
   document.getElementById("g_deva_4").innerText='Сегодня самые обычные вещи подарят Девам самые необычные ощущения. Сегодня Девы смогут оказать кому-то поддержку или дать дельный совет. Девам сегодня не следует проявлять инициативу и помогать тем, кто вас об этом не просил, иначе ваша услуга может оказаться медвежьей. 04.08.2022';
   var myDate = '4.9';
   var current = new Date;
   if (current.getDate () + '.' + (current.getMonth () + 1) == myDate)
   document.getElementById("g_vodoley_4").innerText='Водолеи, сегодня вы найдете вдохновения в детях, либо своих, либо играющих во дворе, только стоит понаблюдать за ними, чтоб в очередной раз понять очевидное. Сегодня отношение Водолеев к просьбам близких людей, может породить серьезный разговор. Сегодня Водолеи будут много думать о детстве, с грустью желая вернуться назад. 04.08.2022';
   var myDate = '5.9';
   var current = new Date;
   if (current.getDate () + '.' + (current.getMonth () + 1) == myDate)
   document.getElementById("g_lev_5").innerText='Вы произведете в обществе такой сильный эффект, о котором не смогли б и мечтать. Подумайте, не забыли ли вы о своих друзьях, когда в вашей жизни появилась любовь? Звезды говорят, что кто-то на вас обижается. Сегодня Львам покажется, что их загнали в угол. 05.08.2022';
   var myDate = '5.9';
   var current = new Date;
   if (current.getDate () + '.' + (current.getMonth () + 1) == myDate)
   document.getElementById("g_raba_5").innerText='«Работа не волк – в лес не убежит» – девиз Рыб на сегодня, которые могут себе позволить устроить день «ничегонеделанья». Этот день Рыбы проживут под выражением Карлсона – «Спокойствие, только спокойствие, это дело житейское!» Сегодня вам покажется, что вы утерли кому-то нос, но не забывайте, что смеется тот, кто смеется последним. 05.08.2022';
   var myDate = '5.9';
   var current = new Date;
   if (current.getDate () + '.' + (current.getMonth () + 1) == myDate)
   document.getElementById("g_deva_5").innerText='Если получите какое-то предложение, не отвечайте сразу, вы должны хорошо подумать. Спонтанные решения – сегодняшний ключ к успеху Дев. Девы, вы полны сомнений относительно своего будущего, поэтому не стоит пока никаких резких движений. 05.08.2022';
   var myDate = '5.9';
   var current = new Date;
   if (current.getDate () + '.' + (current.getMonth () + 1) == myDate)
   document.getElementById("g_vodoley_5").innerText='Водолеи, это ваш день – день самых смелых желаний! Идеальный день для Водолеев вспомнить о старых обещаниях. Не делайте ставки на свой авторитет, сегодня он не сработает. 05.08.2022';
   
   var myDate = '6.9';
   var current = new Date;
   if (current.getDate () + '.' + (current.getMonth () + 1) == myDate)
   document.getElementById("g_lev_6").innerText='Сегодня после обеда у Львов откроется второе дыхание, и они докажут всем, что невозможное возможно. Постарайтесь сегодня не терять контроль над происходящим. Не желая брать на себя ответственность, вы полдня будете искать себе оправдание. 06.08.2022';
   var myDate = '6.9';
   var current = new Date;
   if (current.getDate () + '.' + (current.getMonth () + 1) == myDate)
   document.getElementById("g_raba_6").innerText='Сегодня Рыбы смогут перебороть свою фобию, и проявят невиданное для себя мужество. Вам пора обратить внимание на свою внешность и питание. Сегодня Рыбы могут сделать большую глупость, если будут руководствоваться чужими советами и эмоциями. 06.08.2022';
   var myDate = '6.9';
   var current = new Date;
   if (current.getDate () + '.' + (current.getMonth () + 1) == myDate)
   document.getElementById("g_deva_6").innerText='У Дев возможна случайная встреча со старым другом, которого вы будете очень рады видеть, и если он вас позовет куда-нибудь за собой, не отказывайтесь. Девы, не теряйте головы при виде противоположного пола. Не самый лучший день для бракосочетания. 06.08.2022';
   var myDate = '6.9';
   var current = new Date;
   if (current.getDate () + '.' + (current.getMonth () + 1) == myDate)
   document.getElementById("g_vodoley_6").innerText='Сегодня вы узнаете новость, которая круто изменит вашу жизнь, наполнив ее яркими красками. Если кто-то проявит по отношению к вам агрессию, постарайтесь не отвечать тем же. Если трудно принять решение, лучше обождите. 06.08.2022';
   var myDate = '7.9';
   var current = new Date;
   if (current.getDate () + '.' + (current.getMonth () + 1) == myDate)
   document.getElementById("g_lev_7").innerText='Львы, попробуйте спросить о том, что вас волнует у пожилого человека, возможно, он поможет вам найти ответы на вопросы. Сделайте сюрприз своей второй половинке. Львы, вам не надоело все бросать на полпути? Сколько побед вы уже потеряли? 07.08.2022';
   var myDate = '7.9';
   var current = new Date;
   if (current.getDate () + '.' + (current.getMonth () + 1) == myDate)
   document.getElementById("g_raba_7").innerText='Рыбы, сегодня вы сами для себя наилучший гороскоп, и психолог, и гадалка, поэтому слушайте только себя, чтоб получить отличное самочувствие и желаемое в придачу. Рыбы, постарайтесь сегодня избежать сомнительных компаний, а также общения с людьми, которые не вызывают у вас доверия. Рыбы могут захотеть заиметь то, что им не принадлежит, но подумайте трижды, прежде чем перейти в наступление. 07.08.2022';
   var myDate = '7.9';
   var current = new Date;
   if (current.getDate () + '.' + (current.getMonth () + 1) == myDate)
   document.getElementById("g_deva_7").innerText='Куда б вы не пошли, вам не будет препятствовать ожидание в очередях, которое вас так сильно раздражает. Если что-то сегодня не заладится, а не стоит впадать в панику. Небольшое задание, порученное Девам, может оказаться настоящим поиском иголки в стоге сена. 07.08.2022';
   var myDate = '7.9';
   var current = new Date;
   if (current.getDate () + '.' + (current.getMonth () + 1) == myDate)
   document.getElementById("g_vodoley_7").innerText='В жизни Водолеев возможен переезд, и даже если вы на данный момент выступаете против него, то скоро поймете, что это была хорошая идея. Идеальный день для Водолеев вспомнить о старых обещаниях. Главная задача - сохранить хорошее настроение. 07.08.2022';
   
   var myDate = '8.9';
   var current = new Date;
   if (current.getDate () + '.' + (current.getMonth () + 1) == myDate)
   document.getElementById("g_lev_8").innerText='Предвкушение не разочарует. Надумав «вернуться» в прошлое, поцелуйте сразу того, кто рядом с вами в настоящем. Не стоит замахиваться на новые кулинарные шедевры, чтоб попросту не перевести продукты. 08.08.2022';
   var myDate = '8.9';
   var current = new Date;
   if (current.getDate () + '.' + (current.getMonth () + 1) == myDate)
   document.getElementById("g_raba_8").innerText='Сегодня Рыбам позволено действовать на свой страх и риск, ведь в результате ваши действия будут оправданы. Все новости дня стоит воспринимать спокойно Рыбам. Сегодня Рыбы буквально будут вылазить из штанов, чтоб все успеть, но время как заколдованное идет против них. 08.08.2022';
   var myDate = '8.9';
   var current = new Date;
   if (current.getDate () + '.' + (current.getMonth () + 1) == myDate)
   document.getElementById("g_deva_8").innerText='Отличный день, чтоб приобрести домашнего питомца, который проживет рядом с вами много лет. Сегодня Девам следует позвонить тому, кто уже давно ждет его звонка. Сегодня Девам лучше не тратить деньги на лотерейный билет. 08.08.2022';
   var myDate = '8.9';
   var current = new Date;
   if (current.getDate () + '.' + (current.getMonth () + 1) == myDate)
   document.getElementById("g_vodoley_8").innerText='Сегодня вам покажется, что вы столкнулись с реальной проблемой, но посмотрите на нее с другой стороны и вы поймете, насколько она комична. «Се ля ви» – девиз Водолеев на сегодняшний день. У Водолеев не самый подходящий момент для каких-то изменений, вы им вряд ли будете рады. 08.08.2022';
   var myDate = '9.9';
   var current = new Date;
   if (current.getDate () + '.' + (current.getMonth () + 1) == myDate)
   document.getElementById("g_lev_9").innerText='Сегодня должно повезти влюбленным Львам, которые решат жить вместе с любимым человеком. Не делайте скоропалительных выводов и торопливых шагов. Неосторожная мысль может Львов подтолкнуть к депрессии. 09.08.2022';
   var myDate = '9.9';
   var current = new Date;
   if (current.getDate () + '.' + (current.getMonth () + 1) == myDate)
   document.getElementById("g_raba_9").innerText='Рыбы, сегодня кто-то незнакомый может поднять вашу самооценку. Рыбы, оставайтесь в гармонии с самим собой. Рыбы будут задаваться риторическими вопросами на тему жизни, чем просто будут мучить себя на протяжении дня. 09.08.2022';
   var myDate = '9.9';
   var current = new Date;
   if (current.getDate () + '.' + (current.getMonth () + 1) == myDate)
   document.getElementById("g_deva_9").innerText='Девы могут отправиться в командировку или путешествие, но что бы это ни было, оно будет интригующим. Возможно, Девам сегодня будет очень грустно. Если узнаете чью-то тайну, постарайтесь тот час забыть о ней, она не принесет вам ничего хорошего. 09.08.2022';
   var myDate = '9.9';
   var current = new Date;
   if (current.getDate () + '.' + (current.getMonth () + 1) == myDate)
   document.getElementById("g_vodoley_9").innerText='Сегодня Водолеев ждут приятные растраты, которые не будут стоить им большой сумы денег, но какое же удовольствие принесут. Чтоб сегодня не происходило вокруг, хоть пожар или потоп, а Водолеи будут оставаться спокойными, как никогда. Вам не хватает родного человека рядом, но гордость Водолеям не позволяет вернуть его. 09.08.2022';
   
   var myDate = '10.9';
   var current = new Date;
   if (current.getDate () + '.' + (current.getMonth () + 1) == myDate)
   document.getElementById("g_lev_10").innerText='Сегодня на устах у Львов будет слово фортуна, которая сегодня явно им улыбнется. Сегодня возможна повышенная раздражительность у Львов. Если прислушиваться к советам, этот день пройдет с наименьшими осложнениями. 10.08.2022';
   var myDate = '10.9';
   var current = new Date;
   if (current.getDate () + '.' + (current.getMonth () + 1) == myDate)
   document.getElementById("g_raba_10").innerText='Рыбы, если вас кто-то будет сегодня соблазнять, расслабьтесь и позвольте себя соблазнить, вам понравится. Рыбам стоит выговориться, так что подыщите себе приятного слушателя. Сегодня вы можете убить чью-то мечту. 10.08.2022';
   var myDate = '10.9';
   var current = new Date;
   if (current.getDate () + '.' + (current.getMonth () + 1) == myDate)
   document.getElementById("g_deva_10").innerText='Автомобилисты Девы сегодня весь день будут попадать на зеленую волну. Девам очень будет хотеться сбежать куда-то подальше от дома. К сожалению сегодня, интуиция может подвести Дев. 10.08.2022';
   var myDate = '10.9';
   var current = new Date;
   if (current.getDate () + '.' + (current.getMonth () + 1) == myDate)
   document.getElementById("g_vodoley_10").innerText='Водолеи плывут по жизни медленно, но уверенно, зная, что они уже почти у цели, и от этого их глаза наполнены волшебным блеском. Пора покончить с незаконченными делами Водолеям, стимулируя себя фразой – «сейчас или никогда». Не пытайтесь вернуть то, что уже ушло. 10.08.2022';
   var myDate = '11.9';
   var current = new Date;
   if (current.getDate () + '.' + (current.getMonth () + 1) == myDate)
   document.getElementById("g_lev_11").innerText='Что ж тут долго думать? Отвечайте да! Сегодня стоит чаще прислушиваться к себе. Сегодня амбиции Львов будут смехотворными и неуместными, так что забудьте о них на сегодня. 11.08.2022';
   var myDate = '11.9';
   var current = new Date;
   if (current.getDate () + '.' + (current.getMonth () + 1) == myDate)
   document.getElementById("g_raba_11").innerText='Друзья привнесут в ваш день каплю приятного сумасшествия. Финансовая картина нестабильна, очень трудно проконтролировать движение денежных потоков. Ваша игра в молчанку может ранить близких людей. 11.08.2022';
   var myDate = '11.9';
   var current = new Date;
   if (current.getDate () + '.' + (current.getMonth () + 1) == myDate)
   document.getElementById("g_deva_11").innerText='Почувствовав, что вы падаете духом, позвоните близкому человеку, он найдет для вас нужные слова, и вы опять будете готовы к бою. Не делайте непродуманных поступков. Возможно, сегодня у вас будут незапланированные затраты, с которыми вы будете не согласны. 11.08.2022';
   var myDate = '11.9';
   var current = new Date;
   if (current.getDate () + '.' + (current.getMonth () + 1) == myDate)
   document.getElementById("g_vodoley_11").innerText='Работа сегодня принесет вам хорошие перспективы на будущее. Не принимайте быстрых решений, чтобы сгоряча не наломать дров. Стоит уделить немного времени своим желаниям. 11.08.2022';
   
   var myDate = '12.9';
   var current = new Date;
   if (current.getDate () + '.' + (current.getMonth () + 1) == myDate)
   document.getElementById("g_lev_12").innerText='Все то, за что вы давно не решались взяться, лучше осуществить именно сейчас. Если случайно увидите бездомное животное, не проходите мимо. Львы проведут весь день в ожидании вечера, но не все их надежды будут оправданы. 12.08.2022';
   var myDate = '12.9';
   var current = new Date;
   if (current.getDate () + '.' + (current.getMonth () + 1) == myDate)
   document.getElementById("g_raba_12").innerText='Подходящий день для Рыб, понять в какой сфере деятельности они себя видят. Рыбам очень будет хотеться сбежать куда-то подальше от дома. Вера в свои силы поможет Рыбам справиться с любой задачей. 12.08.2022';
   var myDate = '12.9';
   var current = new Date;
   if (current.getDate () + '.' + (current.getMonth () + 1) == myDate)
   document.getElementById("g_deva_12").innerText='Девы , прислушайтесь к себе сегодня, и если у вас будет момент, когда вам не захочется отвечать на телефонный звонок или чей-то вопрос – не отвечайте. Сегодня Дев могут с кем-то познакомить, и ему абсолютно не стоит стесняться. Сегодня вы, наконец, сможете решить задачку, ответ на которую не принесет облегчения. 12.08.2022';
   var myDate = '12.9';
   var current = new Date;
   if (current.getDate () + '.' + (current.getMonth () + 1) == myDate)
   document.getElementById("g_vodoley_12").innerText='Сегодня Водолеи наконец смогут расшифровать значимые для них события последних лет, и станет понять что, зачем и для чего. Сегодняшний вечер Водолеям полезно провести в спокойной обстановке, например, перед телевизором или почитать. Возможно, сегодня у вас будут незапланированные затраты, с которыми вы будете не согласны. 12.08.2022';
   var myDate = '13.9';
   var current = new Date;
   if (current.getDate () + '.' + (current.getMonth () + 1) == myDate)
   document.getElementById("g_lev_13").innerText='Сегодня харизма Львов работает на полную катушку. Львам стоит сегодня поиграть в психологическую игру – «Найди что-то хорошее в каждом человеке». Львы могут загрустить, вспомнив свои прошлые любовные отношения. 13.08.2022';
   var myDate = '13.9';
   var current = new Date;
   if (current.getDate () + '.' + (current.getMonth () + 1) == myDate)
   document.getElementById("g_raba_13").innerText='День прекрасно подходит для заключения брака и прочих семейных радостей. Постарайтесь сегодня услышать и понять вашего близкого человека. Необходимо действовать экспромтом. 13.08.2022';
   var myDate = '13.9';
   var current = new Date;
   if (current.getDate () + '.' + (current.getMonth () + 1) == myDate)
   document.getElementById("g_deva_13").innerText='Возможно новое знакомство для Дев, которое не окажется длительным, но подарит незабываемые радостные воспоминания. Девы, не делайте сегодня чего-то непривычного для вас, пусть день пройдет по обычному режиму. Возможно, что Девы выместят свое недовольство на ком-то, не имеющем к ситуации никакого отношения. 13.08.2022';
   var myDate = '13.9';
   var current = new Date;
   if (current.getDate () + '.' + (current.getMonth () + 1) == myDate)
   document.getElementById("g_vodoley_13").innerText='Не поддавайтесь давлению извне, не меняйте своих намерений, потому что так будет кому-то удобно, придерживайтесь своего курса и скоро все поймут, что именно он самый правильный. Если вы не соберетесь с силами и не начнете что-то менять, то сегодняшнее ваше «плохо» может перевоплотиться на «еще хуже». Водолеи, не надевайте сегодня одежду, в которой не чувствуете себя комфортно и уверенно. 13.08.2022';
   
   var myDate = '14.9';
   var current = new Date;
   if (current.getDate () + '.' + (current.getMonth () + 1) == myDate)
   document.getElementById("g_lev_14").innerText='Вам будет сопутствовать успех во всех делах. Если вы случайно найдете что-то, что покажется вам золотым, то вспомните о том, что не все то золото что блестит. Чтоб не случилось сегодня у Львов, им не стоит зацикливаться на этом и заниматься самоедством. 14.08.2022';
   var myDate = '14.9';
   var current = new Date;
   if (current.getDate () + '.' + (current.getMonth () + 1) == myDate)
   document.getElementById("g_raba_14").innerText='Если у Рыб есть дела связанные с работой, например, собеседование, значит, оно пройдет как по маслу. Не отказывайте себе в приятной мелочи. Не напрашивайтесь в гости, сегодня вы не совсем желанный гость. 14.08.2022';
   var myDate = '14.9';
   var current = new Date;
   if (current.getDate () + '.' + (current.getMonth () + 1) == myDate)
   document.getElementById("g_deva_14").innerText='Сегодня Девы могут лить слезы, и это здорово, потому что это будут слезы радости. Внимательно слушайте все, что люди сегодня будут говорить про вас, и делайте выводы. Сегодня не стоит выдавать себя за того, кем не являешься, будь собой! 14.08.2022';
   var myDate = '14.9';
   var current = new Date;
   if (current.getDate () + '.' + (current.getMonth () + 1) == myDate)
   document.getElementById("g_vodoley_14").innerText='Сегодня на вашем пути может встретиться человек, который надолго станет вашей опорой и поддержкой. Запишитесь на курсы иностранного языка. Держите эмоции при себе, какими бы они не были. 14.08.2022';
   var myDate = '15.9';
   var current = new Date;
   if (current.getDate () + '.' + (current.getMonth () + 1) == myDate)
   document.getElementById("g_lev_15").innerText='Львы смогут найти дополнительный заработок. Сегодня Львам просто необходим свежий воздух, так что стоит внести в свой плотный график часовую прогулку возле дома. Сегодня Львы может стать отличной мишенью для мелких воришек. 15.08.2022';
   var myDate = '15.9';
   var current = new Date;
   if (current.getDate () + '.' + (current.getMonth () + 1) == myDate)
   document.getElementById("g_raba_15").innerText='Если вы окажитесь в таком месте, где принято загадывать желание, например, бросая монетку в фонтан, обязательно сделайте это! Сегодня нужно меньше говорить и больше делать Рыбам. Рыбам не стоит сегодня нанимать рабочих или пользоваться чьими-то услугами за деньги. 15.08.2022';
   var myDate = '15.9';
   var current = new Date;
   if (current.getDate () + '.' + (current.getMonth () + 1) == myDate)
   document.getElementById("g_deva_15").innerText='Сегодня Девы могут спровоцировать кого-то на легкий флирт, который доставит обоюдную радость, главное изначально быть честным с партнером. Сегодня отличный момент наконец-то доделать мелкие работы, которое итак длительное время были отодвинуты в сторону. Вспомните пословицу – «Тише едешь – дальше будешь», и ни к чему так спешить, пока в спешке ничего не натворили. 15.08.2022';
   var myDate = '15.9';
   var current = new Date;
   if (current.getDate () + '.' + (current.getMonth () + 1) == myDate)
   document.getElementById("g_vodoley_15").innerText='Сегодня некоторые будут искать поддержки и совета Водолеев, что потешит их чувством собственной значимости. Возможно, сегодня Водолеям будет нужна психологическая поддержка близких людей. Водолеям не стоит много думать и анализировать, сегодня это не полезно, нужно просто прожить этот день без лишних эмоций. 15.08.2022';
   
   var myDate = '16.9';
   var current = new Date;
   if (current.getDate () + '.' + (current.getMonth () + 1) == myDate)
   document.getElementById("g_lev_16").innerText='Сегодня все вокруг будто наелись смешинок, и вы тоже заразитесь смехом. Сегодня у кого-то из Львов может рухнуть привычный мир. Львам пойдет на пользу сделать сегодня хоть какую-то мелочь, ведущую к своей мечте. 16.08.2022';
   var myDate = '16.9';
   var current = new Date;
   if (current.getDate () + '.' + (current.getMonth () + 1) == myDate)
   document.getElementById("g_raba_16").innerText='Сегодня вам покажется, что вы столкнулись с реальной проблемой, но посмотрите на нее с другой стороны и вы поймете, насколько она комична. Подумайте, не забыли ли вы о своих друзьях, когда в вашей жизни появилась любовь? Звезды говорят, что кто-то на вас обижается. Возможно, сегодня Рыбы узнают о себе что-то нелицеприятное. 16.08.2022';
   var myDate = '16.9';
   var current = new Date;
   if (current.getDate () + '.' + (current.getMonth () + 1) == myDate)
   document.getElementById("g_deva_16").innerText='Сегодня кто-то захочет помочь Девам и сам заявит об этом, не отказывайтесь от помощи. Если сегодня у Дев получится посмотреть какой-то фильм, выберите комедийный жанр, пусть мозги немного отдохнут. Если Девам выпадет возможность закружиться в танце, не нужно отказываться от нее. 16.08.2022';
   var myDate = '16.9';
   var current = new Date;
   if (current.getDate () + '.' + (current.getMonth () + 1) == myDate)
   document.getElementById("g_vodoley_16").innerText='Водолеи, сегодня вы сами для себя наилучший гороскоп, и психолог, и гадалка, поэтому слушайте только себя, чтоб получить отличное самочувствие и желаемое в придачу. Стоит хоть немного времени уделить уборке своего рабочего места. Сегодня Водолеям не стоит начинать продажу своих вещей, запланируйте это на завтра. 16.08.2022';
   var myDate = '17.9';
   var current = new Date;
   if (current.getDate () + '.' + (current.getMonth () + 1) == myDate)
   document.getElementById("g_lev_17").innerText='Прожить день без напряга у Львов не получится, но в этом и будет изюминка сегодняшнего дня. Спокойный день, в спокойной обстановке для спокойных Львов. Возможно, сегодня Лев увидит того, кто в дальнейшем повлияет на его развитие. 17.08.2022';
   var myDate = '17.9';
   var current = new Date;
   if (current.getDate () + '.' + (current.getMonth () + 1) == myDate)
   document.getElementById("g_raba_17").innerText='Сегодня у Рыб выпадет возможность побыть в роли свахи, вы можете познакомить между собой людей, которые в будущем создадут семью. Максимум, что сегодня можно делать Рыбам – это пускать в ход свою улыбку и обаяние, тогда им все сойдет с рук, даже ошибки на работе. Будьте аккуратны с вашими деньгами, вы можете их случайно потерять. 17.08.2022';
   var myDate = '17.9';
   var current = new Date;
   if (current.getDate () + '.' + (current.getMonth () + 1) == myDate)
   document.getElementById("g_deva_17").innerText='Девы очень нуждаются в том, чтоб быть любимыми, и сегодняшний день может подарить им это ощущение. Не самый лучший день для бракосочетания. Сегодня Девы будут очень кропотливо относиться к делам, но это будет раздражать тех окружающих, которые путают кропотливость с медлительностью. 17.08.2022';
   var myDate = '17.9';
   var current = new Date;
   if (current.getDate () + '.' + (current.getMonth () + 1) == myDate)
   document.getElementById("g_vodoley_17").innerText='Сегодня не тот день, когда Водолеям нужно куда-то бежать и пытаться что-то ухватить. Неустанно карабкаясь вверх, Водолеям не помешало бы задуматься, когда они собственно хотят начинать получать удовольствие от жизни. Водолеи , не обижайте тех, кто слабее, ведь все так переменчиво на этой земле. 17.08.2022';
   
   var myDate = '18.9';
   var current = new Date;
   if (current.getDate () + '.' + (current.getMonth () + 1) == myDate)
   document.getElementById("g_lev_18").innerText='Сегодня Львы могут случайно сказать что-то такое, что перевернет чью-то жизнь с ног на голову, но позже вам скажут за это спасибо. Если получите какое-то предложение, не отвечайте сразу, вы должны хорошо подумать. Не желая брать на себя ответственность, вы полдня будете искать себе оправдание. 18.08.2022';
   var myDate = '18.9';
   var current = new Date;
   if (current.getDate () + '.' + (current.getMonth () + 1) == myDate)
   document.getElementById("g_raba_18").innerText='Чтоб сегодня не случалось, Рыбам следует принимать быстрые решения, руководствуясь тем, что подсказывает сердце, а не разум. Рыбам не стоит сегодня надеяться на чью-то помощь, вы ее не получите. Рыбы , постарайтесь за лживыми улыбками, разглядеть лису. 18.08.2022';
   var myDate = '18.9';
   var current = new Date;
   if (current.getDate () + '.' + (current.getMonth () + 1) == myDate)
   document.getElementById("g_deva_18").innerText='Хороший день для Дев, не будет никаких раздражителей, все дела будут идти как по маслу. Девы, задумайтесь, не преувеличиваете ли вы значимость денег? Возможно, вы забываете о другом счастье. От любви до ненависти всего один шаг, и Девы прочувствуют это на своей шкуре. 18.08.2022';
   var myDate = '18.9';
   var current = new Date;
   if (current.getDate () + '.' + (current.getMonth () + 1) == myDate)
   document.getElementById("g_vodoley_18").innerText='Если вас кто-то сегодня обидит чем-то, не отвечайте тем же, так вам будет лучше. Есть вероятность найти на улице деньги. Сегодня Водолеи могут не оценить искренних порывов любимого человека, чем обидеть его. 18.08.2022';
   var myDate = '19.9';
   var current = new Date;
   if (current.getDate () + '.' + (current.getMonth () + 1) == myDate)
   document.getElementById("g_lev_19").innerText='Сегодня Львам покажется, что весь мир крутится возле них одних. Наслаждайтесь! Благоприятный день для Львов, для решения серьезных задач. Сегодня Львы могут оказаться в роли синоптика, потому что будут «строить погоду» всем окружающим. 19.08.2022';
   var myDate = '19.9';
   var current = new Date;
   if (current.getDate () + '.' + (current.getMonth () + 1) == myDate)
   document.getElementById("g_raba_19").innerText='Сегодня Рыбам будут стремиться на помощь к другу, который сможет оценить вашу дружбу по достоинству. Оградите себя сегодня от телевизионных новостей. Деловая коммуникабельность Рыб сегодня дремлет как никогда, поэтому отложите важные переговоры, чтоб не потерять хороших партнеров. 19.08.2022';
   var myDate = '19.9';
   var current = new Date;
   if (current.getDate () + '.' + (current.getMonth () + 1) == myDate)
   document.getElementById("g_deva_19").innerText='Сегодня от Дев потребуется максимальная самоотдача на работе. Девы , не делайте того, что не сможете смыть со своей совести. Подходящий день для Дев для возобновления старого общения. 19.08.2022';
   var myDate = '19.9';
   var current = new Date;
   if (current.getDate () + '.' + (current.getMonth () + 1) == myDate)
   document.getElementById("g_vodoley_19").innerText='Если вы давно искали что-то эксклюзивное, то сегодня обязательно найдете это. Не стоит сегодня что-то менять Водолеям, пусть пока все остается на своих местах. Чем больше вы занимаетесь чужими делами, тем выше шансы преуспеть в решении собственных проблем. 19.08.2022';
   
   var myDate = '20.9';
   var current = new Date;
   if (current.getDate () + '.' + (current.getMonth () + 1) == myDate)
   document.getElementById("g_lev_20").innerText='Сегодня возможен маленький сюрприз для Львов, который тронет их до глубины души. Хорошо бы подумать об отдыхе Львам, ведь именно сегодня они смогут почувствовать, каких эмоций им не хватает, и где они смогут их получить. У Львов сегодня может получиться неловкий момент, связанный с неудачной шуткой. 20.08.2022';
   var myDate = '20.9';
   var current = new Date;
   if (current.getDate () + '.' + (current.getMonth () + 1) == myDate)
   document.getElementById("g_raba_20").innerText='Ровная осанка, внутреннее спокойствие, обаятельная улыбка – и желаемые перемены будут вашими уже очень скоро. День, наполненный мечтаниями и полетами в облаках у Рыб. Сегодня Рыбы не смогут простить причиненную им боль от любимого человека. 20.08.2022';
   var myDate = '20.9';
   var current = new Date;
   if (current.getDate () + '.' + (current.getMonth () + 1) == myDate)
   document.getElementById("g_deva_20").innerText='Автомобилисты Девы сегодня весь день будут попадать на зеленую волну. Сегодня Девы должны быть аккуратными в спортивных упражнениях, возможны травмы. Девам следует отказаться от поездки на машине во избежание аварии. 20.08.2022';
   var myDate = '20.9';
   var current = new Date;
   if (current.getDate () + '.' + (current.getMonth () + 1) == myDate)
   document.getElementById("g_vodoley_20").innerText='Отличный день для того, чтоб всей семьей придумать свои собственные традиции. Потраченные деньги на отдых не принесут удовольствие Водолеям. Возможны, дополнительные задания от начальства. 20.08.2022';
   var myDate = '21.9';
   var current = new Date;
   if (current.getDate () + '.' + (current.getMonth () + 1) == myDate)
   document.getElementById("g_lev_21").innerText='Львы , сегодня можете просить что угодно и у кого угодно, все для вас одних. У Львов сегодняшний день пройдет на бегу, и по идее он должен все успеть. Чтобы не случилось, Львы, вам не стоит рубить с плеча, все ваши действия должны быть хорошо обдуманными. 21.08.2022';
   var myDate = '21.9';
   var current = new Date;
   if (current.getDate () + '.' + (current.getMonth () + 1) == myDate)
   document.getElementById("g_raba_21").innerText='Сегодня все цвета карандашей в ваших руках, поэтому вы сами можете раскрасить свой день. Сегодня Рыбам желательно проявить свои самые теплые чувства по отношению к любимым, и вспомнить, что любовь – это не только слова, а больше поступки. Сегодня Рыбам не следует давать денег в долг, даже проверенным людям. 21.08.2022';
   var myDate = '21.9';
   var current = new Date;
   if (current.getDate () + '.' + (current.getMonth () + 1) == myDate)
   document.getElementById("g_deva_21").innerText='Сегодня Девы могут получить предложение, которого долго ждали. Сегодня не стоит открывать душу малознакомым людям, это не подходящий день для откровений. Девам не стоит опускаться до зависти. 21.08.2022';
   var myDate = '21.9';
   var current = new Date;
   if (current.getDate () + '.' + (current.getMonth () + 1) == myDate)
   document.getElementById("g_vodoley_21").innerText='Чем бы ни занималась команда, в которой присутствует Водолей, она будет иметь успех, будь то спортивная игра или общий творческий проект на работе. Подумайте, может, вы давно не уделяли должного внимания своей второй половинке? Сегодня есть шанс все исправить. Возможно, вами сегодня не будет доволен начальник, но Водолеев. 21.08.2022';
   
   var myDate = '22.9';
   var current = new Date;
   if (current.getDate () + '.' + (current.getMonth () + 1) == myDate)
   document.getElementById("g_lev_22").innerText='Львы, продолжайте делать добро и когда-нибудь вы определенно спасете этот мир. Сегодня не обязательно хотеть большего Львам, попробуйте получить удовольствие от того что есть. Сегодня Львам не стоит доказывать свою точку зрения старшим людям. 22.08.2022';
   var myDate = '22.9';
   var current = new Date;
   if (current.getDate () + '.' + (current.getMonth () + 1) == myDate)
   document.getElementById("g_raba_22").innerText='Если вас давно тянуло сходить в церковь, сегодняшний день идеально подойдет для разговора с Богом. Рыбы, не пытайтесь загребать жар чужими руками. Сегодня Рыбам покажется, что их загнали в угол. 22.08.2022';
   var myDate = '22.9';
   var current = new Date;
   if (current.getDate () + '.' + (current.getMonth () + 1) == myDate)
   document.getElementById("g_deva_22").innerText='Сегодня на вашем пути может встретиться человек, который надолго станет вашей опорой и поддержкой. Не торопитесь судить окружающих, хотя именно сегодня у вас будет такое желание. Сегодня у Дев все будет валиться с рук. 22.08.2022';
   var myDate = '22.9';
   var current = new Date;
   if (current.getDate () + '.' + (current.getMonth () + 1) == myDate)
   document.getElementById("g_vodoley_22").innerText='Если хотите иметь хорошую физическую форму начните заниматься ею прямо сегодня. Древняя мудрость, которая гласит, что «Молчание – это золото», будет уместна по отношению к Водолеям. причем во всех сферах жизни. Никакие приятные мелочи не смогут поднять Водолеям настроение, поэтому если есть возможность – ложитесь спать. 23.08.2022';
   var myDate = '23.9';
   var current = new Date;
   if (current.getDate () + '.' + (current.getMonth () + 1) == myDate)
   document.getElementById("g_lev_23").innerText='Сегодня Лев наконец почувствует себя хозяином своей судьбы, спрячет депрессию в дальний ящик, и найдет правильно решение дальнейших действий. Сегодня Львы могут расстаться со своей половинкой, о чем потом пожалеют. Львы, как всегда все рассчитали и просчитали, но могут появиться непредвиденные ситуации. 23.08.2022';
   var myDate = '23.9';
   var current = new Date;
   if (current.getDate () + '.' + (current.getMonth () + 1) == myDate)
   document.getElementById("g_raba_23").innerText='Что ж тут долго думать? Отвечайте да! Пусть все идет свои чередом, главное дышите ровно. Старания Рыб по отношению ко второй половинке, могут оказаться неоцененными ею. 23.08.2022';
   var myDate = '23.9';
   var current = new Date;
   if (current.getDate () + '.' + (current.getMonth () + 1) == myDate)
   document.getElementById("g_deva_23").innerText='Девы очень хотят потанцевать, и сегодня, наконец, у них это должно получиться. Девы, вам не надоело все бросать на полпути? Сколько побед вы уже потеряли? Не задавайте людям много вопросов, скорее всего вы будете их раздражать. 23.08.2022';
   var myDate = '23.9';
   var current = new Date;
   if (current.getDate () + '.' + (current.getMonth () + 1) == myDate)
   document.getElementById("g_vodoley_23").innerText='Сегодня у Водолеев обнаружиться талант красноречия, так что сможете завлечь всех своими рассказами. Не позволяйте сегодня чужим людям управлять вами. Водолеи , вы безжалостно гоняете себя по кругу самобичевания, и скоро обессиленные упадете намертво, но ничего не изменить, живите дальше. 23.08.2022';
   
   var myDate = '24.9';
   var current = new Date;
   if (current.getDate () + '.' + (current.getMonth () + 1) == myDate)
   document.getElementById("g_lev_24").innerText='Если у Львов есть дела связанные с работой, например, собеседование, значит, оно пройдет как по маслу. Сегодня не стоит себя накручивать Львам, все намного проще, чем, кажется. Нерешительные Львы опять упустят свой шанс. 24.08.2022';
   var myDate = '24.9';
   var current = new Date;
   if (current.getDate () + '.' + (current.getMonth () + 1) == myDate)
   document.getElementById("g_raba_24").innerText='Отличный вечер, чтоб провести его в семейном кругу. Сегодня не самый благоприятный день для работы с важными документами и оформления имущества. Старайтесь избегать необдуманных решений, не принимайте решения сгоряча. 24.08.2022';
   var myDate = '24.9';
   var current = new Date;
   if (current.getDate () + '.' + (current.getMonth () + 1) == myDate)
   document.getElementById("g_deva_24").innerText='Сегодняшний день хорош для познания всего нового: развлечения, путешествия, отдых, новые знакомства и знания. Не принимайте быстрых решений, чтобы сгоряча не наломать дров. Не подходящий день для больших покупок, они могут вскоре разочаровать вас. 24.08.2022';
   var myDate = '24.9';
   var current = new Date;
   if (current.getDate () + '.' + (current.getMonth () + 1) == myDate)
   document.getElementById("g_vodoley_24").innerText='Водолеи смогут найти дополнительный заработок. Вам не хватает родного человека рядом, но гордость Водолеям не позволяет вернуть его. Если кто-то проявит по отношению к вам агрессию, постарайтесь не отвечать тем же. 24.08.2022';

   var myDate = '25.9';
   var current = new Date;
   if (current.getDate () + '.' + (current.getMonth () + 1) == myDate)
   document.getElementById("g_lev_1").innerText='Львы, если вас кто-то будет сегодня соблазнять, расслабьтесь и позвольте себя соблазнить, вам понравится. Сегодня Львам не стоит опускаться до сплетен и критики чьих-то поступков. Не пытайтесь ни за кем шпионить, все, что вы сможете вынюхать, не принесет вам добра, ведь есть вероятность того, что вы просто не сможете правильно истолковать это. 25.08.2022';
   var myDate = '25.9';
   var current = new Date;
   if (current.getDate () + '.' + (current.getMonth () + 1) == myDate)
   document.getElementById("g_raba_25").innerText='Куда б вы не пошли, вам не будет препятствовать ожидание в очередях, которое вас так сильно раздражает. Пора покончить с незаконченными делами Рыбам, стимулируя себя фразой – «сейчас или никогда». Новые друзья могут принести в вашу жизнь новые проблемы. 25.08.2022';
   var myDate = '25.9';
   var current = new Date;
   if (current.getDate () + '.' + (current.getMonth () + 1) == myDate)
   document.getElementById("g_deva_25").innerText='Девы, разрешите тому, кто сегодня рядом с вами побаловать вас, ваш лед уже не уместен, пришло время растаять и вы не пожалеете. Чтоб сегодня не происходило вокруг, хоть пожар или потоп, а Девы будут оставаться спокойными, как никогда. Девы, не переборщите с алкоголем, чтоб не наделать глупостей. 25.08.2022';
   var myDate = '25.9';
   var current = new Date;
   if (current.getDate () + '.' + (current.getMonth () + 1) == myDate)
   document.getElementById("g_vodoley_25").innerText='Сегодня Водолеи могут случайно наткнуться на информацию, которая заставит их задуматься над нынешним положением вещей, и подтолкнет к положительным переменам. Если трудно принять решение, лучше обождите. Сегодня Водолеям захочется пойти против правил и сделать что-то наперекор всем, но социум окажется сильней вас, поэтому остынете немного. 25.08.2022';
   
   var myDate = '26.9';
   var current = new Date;
   if (current.getDate () + '.' + (current.getMonth () + 1) == myDate)
   document.getElementById("g_lev_26").innerText='Львы смогут стать центром и душой компании, поэтому не бойтесь принимать приглашения, даже если вас позовут в незнакомую компанию. Сегодня Львы могут оказаться в незнакомой компании. Львы, не считайте себя всемогущими, не пытайтесь переделать то, что невозможно. 26.08.2022';
   var myDate = '26.9';
   var current = new Date;
   if (current.getDate () + '.' + (current.getMonth () + 1) == myDate)
   document.getElementById("g_raba_26").innerText='Не бойтесь подписывать договора, сегодня звезды гарантирует вам выгоду и безопасность. Древняя мудрость, которая гласит, что «Молчание – это золото», будет уместна по отношению к Рыбам. причем во всех сферах жизни. Если не хотите услышать чего-то неприятного для вас, не заводите откровенных разговоров. 26.08.2022';
   var myDate = '26.9';
   var current = new Date;
   if (current.getDate () + '.' + (current.getMonth () + 1) == myDate)
   document.getElementById("g_deva_26").innerText='Сегодня Дев смогут заняться чистотой в своем жилье, и процесс уборки даже не будет их раздражать. Постарайтесь сегодня не терять контроль над происходящим. Девы не введитесь на внешность, сегодня она как никогда может оказаться обманчивой. 26.08.2022';
   var myDate = '26.9';
   var current = new Date;
   if (current.getDate () + '.' + (current.getMonth () + 1) == myDate)
   document.getElementById("g_vodoley_26").innerText='Сегодня Водолеи будут в центе внимания родных людей, для которых вы стали гордостью. Возможно, сегодня кто-то не сможет сдержать данного Водолеям обещания, что очень расстроит их. Пытаясь поговорить с любимым человеком, вы ничего не сможете ему донести. Он останется глухим к вашим словам. 26.08.2022';
   var myDate = '27.9';
   var current = new Date;
   if (current.getDate () + '.' + (current.getMonth () + 1) == myDate)
   document.getElementById("g_lev_27").innerText='Сегодня Львы по настоящему неуязвимы перед всем. Сегодня Львы могут заиграться, потеряв связь с реальной жизнью, но она все равно сорвет с вас маску. Сегодня Львы могут послать все к черту, но уже завтра пожалеют об этом. 27.08.2022';
   var myDate = '27.9';
   var current = new Date;
   if (current.getDate () + '.' + (current.getMonth () + 1) == myDate)
   document.getElementById("g_raba_27").innerText='Бездумное решение Рыб приведет их к бездумному поступку, который в свою очередь подарит безграничную радость. Дабы ни о чем не жалеть, ничего особенного сегодня не делайте. Избегайте споров с окружающими: не исключены конфликты. 27.08.2022';
   var myDate = '27.9';
   var current = new Date;
   if (current.getDate () + '.' + (current.getMonth () + 1) == myDate)
   document.getElementById("g_deva_27").innerText='Для Дев день пройдет, как у Бога за пазухой. Девы будут гореть желанием выплеснуть на кого-то свой пар, но это будет неправильно. Не тратьте время на учебу, отложите ее на завтра, сегодня ваш ум на отдыхе. 27.08.2022';
   var myDate = '27.9';
   var current = new Date;
   if (current.getDate () + '.' + (current.getMonth () + 1) == myDate)
   document.getElementById("g_vodoley_27").innerText='Это отличный день для осуществления любых замыслов Водолеев, требующих решительности. Подумайте, может, вы давно не уделяли должного внимания своей второй половинке? Сегодня есть шанс все исправить. Не стоит целый день думать о деньгах, которых вам так не хватает, ведь их не хватает всем и всегда, попробуйте порадоваться тому, что имеете. 27.08.2022';
   
   var myDate = '28.9';
   var current = new Date;
   if (current.getDate () + '.' + (current.getMonth () + 1) == myDate)
   document.getElementById("g_lev_28").innerText='Если коллега на работе опять попытается вас зацепить, сегодня можете не игнорировать ее, а ответить в том же тоне. На какое-то время она от вас отстанет. Не стоит сегодня что-то менять Львам, пусть пока все остается на своих местах. Львы, поднимите голову к небу, остановитесь и поймите, что потом вы уже ничего не сможете изменить. 28.08.2022';
   var myDate = '28.9';
   var current = new Date;
   if (current.getDate () + '.' + (current.getMonth () + 1) == myDate)
   document.getElementById("g_raba_28").innerText='Не поддавайтесь давлению извне, не меняйте своих намерений, потому что так будет кому-то удобно, придерживайтесь своего курса и скоро все поймут, что именно он самый правильный. У Рыб сегодняшний день пройдет на бегу, и по идее он должен все успеть. Сегодня не стоит обращаться за помощью к силам магии, иначе наткнетесь на обычного шарлатана. 28.08.2022';
   var myDate = '28.9';
   var current = new Date;
   if (current.getDate () + '.' + (current.getMonth () + 1) == myDate)
   document.getElementById("g_deva_28").innerText='Дева, забудь хоть ненадолго о своей подозрительности и осторожности по отношению к людям, и жизнь преподнесет вам такой сюрприз, о котором вы и не мечтали! Девы, не пытайтесь сегодня успеть все, лишние нервотрепки вам ни к чему, размерено занимайтесь самым важным делом, не распыляясь на мелочи. Пора сбавить обороты своего эгоизма. 28.08.2022';
   var myDate = '28.9';
   var current = new Date;
   if (current.getDate () + '.' + (current.getMonth () + 1) == myDate)
   document.getElementById("g_vodoley_28").innerText='Сегодня Водолеи так легко смогут радоваться мелочам. Сегодня к вам могут спонтанно нагрянуть друзья, и даже если вы планировали нечто иное, не расстраивайтесь, вечер будет приятным. Сегодня Водолеи не должны принимать предложений от противоположного пола. 28.08.2022';
   var myDate = '29.9';
   var current = new Date;
   if (current.getDate () + '.' + (current.getMonth () + 1) == myDate)
   document.getElementById("g_lev_29").innerText='Львы освободите себя от того, что тянет вас вниз, вы об этом не пожалеете. Чтоб сегодня не случилось, не выдавайте собственных эмоций окружающим. Сегодня не следует говорить громких слов Львам, дабы в скором времени они не обернулись против них самих. 29.08.2022';
   var myDate = '29.9';
   var current = new Date;
   if (current.getDate () + '.' + (current.getMonth () + 1) == myDate)
   document.getElementById("g_raba_29").innerText='Сегодня Рыбы должны сказать себе – «Я смогу!», потому что реально смогут. Найдите свободный час, чтоб профильтровать свою телефонную книгу. Сегодня не стоит вкладывать деньги во что либо. 29.08.2022';
   var myDate = '29.9';
   var current = new Date;
   if (current.getDate () + '.' + (current.getMonth () + 1) == myDate)
   document.getElementById("g_deva_29").innerText='Сегодня Девы могут выехать на встречную полосу всем стереотипам, системам и убеждениям, но проедут ее очень успешно. Гороскоп рекомендует вам даже в момент самых горячих споров не переходить за рамки приличия, иначе высказанное может серьезно вас рассорить. Сегодня Девы могут сделать большую глупость, если будут руководствоваться чужими советами и эмоциями. 29.08.2022';
   var myDate = '29.9';
   var current = new Date;
   if (current.getDate () + '.' + (current.getMonth () + 1) == myDate)
   document.getElementById("g_vodoley_29").innerText='Отличный день, чтоб приобрести домашнего питомца, который проживет рядом с вами много лет. Не самый лучший день для посещения общественных развлекательных мест. Сегодня сердце Водолеев пронзит разочарование. 29.08.2022';
   
   var myDate = '30.9';
   var current = new Date;
   if (current.getDate () + '.' + (current.getMonth () + 1) == myDate)
   document.getElementById("g_lev_30").innerText='Сегодняшний день даст вам возможность осуществить акт благотворительности. Львы , не обманывайтесь, считая себя пупом земли. Сегодня вам покажется, что вы утерли кому-то нос, но не забывайте, что смеется тот, кто смеется последним. 30.08.2022';
   var myDate = '30.9';
   var current = new Date;
   if (current.getDate () + '.' + (current.getMonth () + 1) == myDate)
   document.getElementById("g_raba_30").innerText='Спонтанная и бредовая, но озвученная вслух идея Рыб найдет поддержку со стороны окружающих. Возможно сегодня Рыбам целый день будет хотеться «того – не знаю чего». Не совершайте никаких покупок на расстоянии, например через интернет, можете попасть на плохого продавца или товар окажется не таким, как его показали. 30.08.2022';
   var myDate = '30.9';
   var current = new Date;
   if (current.getDate () + '.' + (current.getMonth () + 1) == myDate)
   document.getElementById("g_deva_30").innerText='Постарайтесь сегодня занять позицию слушателя, и собеседнику сделаете приятно, и сами узнаете много нового и интересного. Побалуйте тех, кого любите. Глупая ревность, как паранойя будет преследовать Дев. 30.08.2022';
   var myDate = '30.9';
   var current = new Date;
   if (current.getDate () + '.' + (current.getMonth () + 1) == myDate)
   document.getElementById("g_vodoley_30").innerText='Сегодня мелкие проказы Водолеев будут наоборот умилять близких им людей. Если сегодня вы услышите какой-то совет от старшего человека, стоит прислушаться. На сегодня Водолеям не стоит забывать о старой пословице «Семь раз отмерь, один раз отрежь», иначе они могут что-то сильно испортить. 30.08.2022';
   


*/

/*
var arr = new Array();

arr[0]="Надо любить жизнь больше, чем смысл жизни.\n\n|Фёдор Достоевский|";
arr[1]="Логика может привести Вас от пункта А к пункту Б, а воображение — куда угодно. \n\n| Альберт Эйнштейн |";
arr[2]="80% успеха - это появиться в нужном месте в нужное время. \n\n|Вуди Аллен|";

arr[3]="В моем словаре нет слова «невозможно». \n\n| Наполеон Бонапарт |";
arr[4]="Вы никогда не пересечете океан, если не наберетесь мужества потерять берег из виду.\n\n| Христофор Колумб |";
arr[5]="Два самых важных дня в твоей жизни: день, когда ты появился на свет, и день, когда понял, зачем. \n\n| Марк Твен |";
arr[6]="Все дело в мыслях. Мысль — начало всего. И мыслями можно управлять. И поэтому главное дело совершенствования: работать над мыслями. \n\n| Лев Толстой |";
arr[7]="Есть только один способ избежать критики: ничего не делайте, ничего не говорите и будьте никем. \n\n| Аристотель |";
arr[8]="Не стоит винить ребенка за то, что он боится темноты. Настоящая трагедия – это когда взрослый человек боится света. \n\n| Платон |";
arr[9]="Упади семь раз и восемь раз поднимись. \n\n| Японская поговорка |";
arr[10]="У всего есть своя красота, но не каждый может ее увидеть. \n\n| Конфуций |";
arr[11]="Мудрый человек требует всего только от себя, ничтожный же человек требует всего от других.\n\n | Лев Толстой |";
arr[12]="Каждый хочет изменить человечество, но никто не задумывается о том, как изменить себя.\n\n | Лев Толстой |";
arr[13]="Лучшее время, чтобы посадить дерево, было 20 лет назад. Следующий подходящий момент - сегодня. \n\n| Китайская пословица |";
arr[14]="Поражение – не поражение, если только вы не признаете его таковым в своем сознании.\n\n | Брюс Ли |";
arr[15]="Никогда не делает ошибок только тот, кто не пробует ничего нового. \n\n| Альберт Эйнштейн |";
arr[16]="Счастье не в том, чтобы делать всегда, что хочешь, а в том, чтобы всегда хотеть того, что делаешь. \n\n| Лев Толстой |";
arr[17]="Никогда не думайте, что вы уже все знаете. И как бы высоко не оценивали вас, всегда имейте мужество сказать себе: «Я невежда». \n\n| Иван Павлов, ученый-физиолог |";
arr[18]="Не столь важно, как медленно ты идешь, как то, как долго ты идешь, не останавливаясь. \n\n| Аристотель |";
arr[19]="Запомните, что не достичь успеха – иногда тоже большая удача. \n\n| Далай Лама |";
arr[20]="Всякая мысль подобна тесту, стоит помять ее хорошенько — все из нее сделаешь. \n\n| Иван Тургенев |";
arr[21]="Великие дела нужно совершать, а не обдумывать бесконечно.\n\n | Юлий Цезарь |";
arr[22]="Поистине всегда там, где недостает разумных доводов, — их заменяет крик. \n\n| Леонардо да Винчи |";
arr[23]="Музыка принадлежит всем. Только фирмы звукозаписи еще верят, что ее владельцы — они.\n\n | Джон Леннон |";
arr[24]="Старость — самая большая неожиданность в жизни. \n\n| Лев Толстой |";
arr[25]="Надо быть ясным умственно, чистым нравственно и опрятным физически. \n\n| А. Чехов |";
arr[26]="Нет силы более могучей, чем знание; человек, вооружённый знанием, — непобедим.  \n\n| М. Горький |";
arr[27]="Нет уз святее товарищества!  \n\n| Н. Гоголь |";
arr[28]="Зачем же гнаться по следам того, что уже окончено.  \n\n| М. Булгаков |";
arr[29]="Источник силы или бессилия общества — духовный уровень жизни, а уже потом — уровень промышленности. \n\n| А. Солженицын |";
arr[30]="Любить — значит жить жизнью того, кого любишь. \n\n| Л. Толстой |";
arr[31]="Блаженство наше в отношении детей наших зависит много от нас самих. \n\n| А. Радищев |";
arr[30]="На то и молодость дана, чтобы быть кипучей, активной, жизнеутверждающей.  \n\n| М. Шолохов |";
arr[31]="Наши недостатки растут на одной почве с нашими достоинствами, и трудно вырвать одни, пощадив другие.  \n\n| И. Тургенев |";
arr[32]="Каждый интеллигентный человек читал Тургенева и Толстого, но далеко не каждый платил за их сочинения. \n\n| А. Чехов |";
arr[33]="Неужели с того, что вы меня богатее, то у вас и чувств больше? \n\n| Н. Лесков |";
arr[34]="Детей не отпугнешь суровостью, они не переносят только лжи. \n\n| Детей не отпугнешь суровостью, они не переносят только лжи. |";
arr[35]="Дорога-то у нас одна, да едут все по-разному… \n\n| М. Шолохов |";
arr[36]="Ничто так не обескураживает пророка, как сознание, что он угадан и что по поводу его уже раздался смех.  \n\n| М. Салтыков-Щедрин |";
arr[37]="Истина — одно из немногих русских слов, которое ни с чем не рифмуется. \n\n| В. Набоков |";
arr[38]="Величайшие истины — самые простые.  \n\n| Л. Толстой |";
arr[39]=" Странно, что вот деньги есть, а мечта остается мечтой.\n\n| В. Набоков |";
arr[40]="Страданием своим русский народ как бы наслаждается. \n\n| Ф. Достоевский |";
arr[41]=" У души, как и у тела, есть своя гимнастика, без которой душа чахнет, впадает в апатию бездействия.\n\n| В. Белинский |";
arr[42]="Дети святы и чисты. Нельзя делать их игрушкою своего настроения. \n\n| А. Чехов |";
arr[43]="Не засоряйте свою память обидами, а то там может просто не остаться места для прекрасных мгновений. \n\n| Ф. Достоевский |";
arr[44]=" Дешева кровь на червонных полях, и никто выкупать ее не будет.\n\n| М. Булгаков |";
arr[45]="Если, читая, тебе захочется спать, то сложи книгу и усни. Береги ее для бессонницы. \n\n| А. Радищев |";
arr[46]=" Никто не сделает первый шаг, потому что каждый думает, что это не взаимно. \n\n| Ф. Достоевский |";
arr[47]="Здоровье — всему голова.  \n\n| М. Шолохов |";
arr[48]="Когда человеку очень хорошо, мозг его, как известно, весьма мало действует.  \n\n| И. Тургенев |";
arr[49]="Земля наша богата, порядка в ней лишь нет. \n\n| А. Толстой |";
arr[50]="Если враг не сдаётся, — его уничтожают. \n\n| М. Горький |";

var rand = Math.floor(Math.random() * arr.length);
document.getElementById("z_zitata_1").innerText=arr[rand];

*/
function zapekan() {
  window.location.href = "zapekanka/indexzapekan.html";
}

function tort() {
  window.location.href = "tort/indextort.html";
}

function pirogi() {
  window.location.href = "pirog/indexpirogi.html";
}

function sali() {
  window.location.href = "salat/indexsali.html";
}

function razn() {
  window.location.href = "raznoe/indexrazn.html";
}

function kash() {
  window.location.href = "kasha/indexkash.html";
}

function vidos() {
  window.location.href = "video/raznoe.html";
}

function razrab() {
  window.location.href = "index_forma_avtor/enter.php";
}

/*
var arrn = new Array();

arrn[0]="А знал ли ты что... Страусы развивают скорость до 70 км/ч";
arrn[1]="А знал ли ты что... Скорость распространения лавы после извержения, близка к скорости бега гончей (от 50 до 70 км/ч)";
arrn[2]="А знал ли ты что... Есть пробирка, диаметр которой, в 10000 раз меньше диаметра человеческого волоса";
arrn[3]="А знал ли ты что... У медуз нет мозгов и кровеносных сосудов";
arrn[4]="А знал ли ты что... Утки способны нырять на глубину до 6 метров";
arrn[5]="А знал ли ты что... Самое высокое здание в Европе находится в Москве";
arrn[6]="А знал ли ты что... Среднее облако весит примерно 500 тонн, то есть как вес примерно 80 слонов";
arrn[7]="А знал ли ты что... Земля делает полный оборот вокруг своей оси за 23 часа 56 минут и 4 секунды";
arrn[8]="А знал ли ты что... За один только год на Землю падает до 500 кг марсианского метеорита";
arrn[9]="А знал ли ты что... Самый долгий полёт курицы продолжался 13 секунд";
arrn[10]="А знал ли ты что... Правое лёгкое человека вмещает больше воздуха, чем левое";
arrn[11]="А знал ли ты что... Летучие мыши всегда поворачивают налево, вылетая из пещеры";
arrn[12]="А знал ли ты что... Если вы будете жевать жвачку во время резки лука – вы не заплачете";
arrn[13]="А знал ли ты что... Титаник был первым кораблем, который использовал сигнал SOS при бедствии";
arrn[14]="А знал ли ты что... Человеческий зрачок расширяется на 45%, когда мы смотрим на что-то приятное";
arrn[15]="А знал ли ты что... Петухи не смогут кукарекать, если не смогут двигать своей шеей.";
arrn[16]="А знал ли ты что... Каждый раз, когда вы чихаете, некоторые мозговые клетки у вас в голове отмирают";
arrn[17]="А знал ли ты что... Ваше левое легкое меньше правого, из-за того, что оно “освобождает” место для сердца";
arrn[18]="А знал ли ты что... Когда вы краснеете, то внутренняя сторона вашего желудка тоже краснеет";
arrn[19]="А знал ли ты что... Кенгуру покрывают более 12 метров в прыжке";
arrn[20]="А знал ли ты что... Женщины моргают почти вдвое чаще, чем мужчины";
arrn[21]="А знал ли ты что... Человеческие волосы и ногти продолжают расти и после смерти";
arrn[22]="А знал ли ты что... Пластиковая штучка на конце шнурка называется пистончик или аксельбант";
arrn[23]="А знал ли ты что... По статистике немецкие овчарки кусали больше людей, чем все остальные собаки";
arrn[24]="А знал ли ты что... Пингвин, единственная птица, котораю умеет плавать, но не умеет летать";
arrn[25]="А знал ли ты что... 2 + 2 = 4";

var rand = Math.floor(Math.random() * arrn.length);
document.getElementById("mal").innerText=arrn[rand];
*/

// function podrob(){
//   //window.scrollTo(0,200); или scrollBy
//   window.scrollTo({
//     top: 750,
//     left: 0,
//     // smooth, instant, auto по умолчанию
//     behavior: "smooth"
//   });
// }
/*
 document.querySelector("#az").addEventListener('click', function(){
    document.querySelector("#t").classList.toggle("podz");
    document.querySelector("#t6").classList.add("podz6");
    document.querySelector("#t2").classList.add("podz2");
    document.querySelector("#t3").classList.add("podz3");
    document.querySelector("#t4").classList.add("podz4");
    document.querySelector("#t5").classList.add("podz5");
  });
  */

document.querySelector("#ia").addEventListener("click", function () {
  document.querySelector("#menu-item").classList.toggle("menu-content-item");
});

/*Торт*/
document.querySelector("#a2").addEventListener("click", function () {
  document.querySelector("#tort-2").classList.toggle("tort-2-item");

  document.querySelector("#zapekanka-2").classList.add("zapekanka-2-item");
  document.querySelector("#salat-2").classList.add("salat-2-item");
  document.querySelector("#pirog-2").classList.add("pirog-2-item");
  document.querySelector("#kasha-2").classList.add("kasha-2-item");
  document.querySelector("#raznoe-2").classList.add("raznoe-2-item");
  document.querySelector(".all-alls").style.display = "none";
  
});

/*Запеканка*/
document.querySelector("#a1").addEventListener("click", function () {
  document.querySelector("#zapekanka-2").classList.toggle("zapekanka-2-item");

  document.querySelector("#salat-2").classList.add("salat-2-item");
  document.querySelector("#pirog-2").classList.add("pirog-2-item");
  document.querySelector("#kasha-2").classList.add("kasha-2-item");
  document.querySelector("#raznoe-2").classList.add("raznoe-2-item");
  document.querySelector(".all-alls").style.display = "none";
  document.querySelector("#tort-2").classList.add("tort-2-item");
});

/*Салат*/
document.querySelector("#a4").addEventListener("click", function () {
  document.querySelector("#salat-2").classList.toggle("salat-2-item");
  document.querySelector("#pirog-2").classList.add("pirog-2-item");
  document.querySelector("#kasha-2").classList.add("kasha-2-item");
  document.querySelector("#raznoe-2").classList.add("raznoe-2-item");
  document.querySelector("#tort-2").classList.add("tort-2-item");
  document.querySelector(".all-alls").style.display = "none";
  document.querySelector("#zapekanka-2").classList.add("zapekanka-2-item");
});

/*Пирог*/
document.querySelector("#a3").addEventListener("click", function () {
  document.querySelector("#pirog-2").classList.toggle("pirog-2-item");
  document.querySelector("#salat-2").classList.add("salat-2-item");
  document.querySelector("#kasha-2").classList.add("kasha-2-item");
  document.querySelector("#raznoe-2").classList.add("raznoe-2-item");
  document.querySelector(".all-alls").style.display = "none";
  document.querySelector("#tort-2").classList.add("tort-2-item");
  document.querySelector("#zapekanka-2").classList.add("zapekanka-2-item");
});

/*Каша*/
document.querySelector("#a5").addEventListener("click", function () {
  document.querySelector("#kasha-2").classList.toggle("kasha-2-item");
  document.querySelector("#salat-2").classList.add("salat-2-item");
  document.querySelector("#pirog-2").classList.add("pirog-2-item");
  document.querySelector("#raznoe-2").classList.add("raznoe-2-item");
  document.querySelector("#tort-2").classList.add("tort-2-item");
  document.querySelector(".all-alls").style.display = "none";
  document.querySelector("#zapekanka-2").classList.add("zapekanka-2-item");
});

/*Разное*/
document.querySelector("#a66").addEventListener("click", function () {
  document.querySelector("#raznoe-2").classList.toggle("raznoe-2-item");
  document.querySelector("#salat-2").classList.add("salat-2-item");
  document.querySelector(".all-alls").style.display = "none";
  document.querySelector("#pirog-2").classList.add("pirog-2-item");
  document.querySelector("#kasha-2").classList.add("kasha-2-item");
  document.querySelector("#tort-2").classList.add("tort-2-item");
  document.querySelector("#zapekanka-2").classList.add("zapekanka-2-item");
});
